"""
参考タイタニック
title_mapping = {"Mr": 1, "Miss": 2, "Mrs": 3, "Master": 4, "Rare": 5}
for dataset in combine:
    dataset['Title'] = dataset['Title'].map(title_mapping)
    dataset['Title'] = dataset['Title'].fillna(0)

train_df.head()
"""
land_value_mapping={
'中央区':59,'千代田区':58,'港区':57,'渋谷区':56,'新宿区':55,'豊島区':54,
'台東区':53,'文京区':52,'武蔵野市':51,'目黒区':50,
'品川区':49,'中野区':48,'世田谷区':47,'杉並区':46,'北区':45,'荒川区':44,'立川市':43,
'江東区':42,'墨田区':41,'三鷹市':40,
'大田区':39,'板橋区':38,'小金井市':37,'練馬区':36,'国分寺市':35,
'江戸川区':34,'足立区':33,'調布市':32,'葛飾区':31,'府中市':30,
'国立市':29,'狛江市':28,'西東京市':27,'小平市':26,'稲城市':25,'多摩市':24,
'清瀬市':23,'町田市':22,'東村山市':21,'東久留米市':20,
'日野市':19,'昭島市':18,'福生市':17,'東大和市':16,'八王子市':15,'羽村市':14,
'武蔵村山市':13,'瑞穂町':12,'青梅市':11,
'あきる野市':10,'日の出町':9,'奥多摩町':8,'小笠原村':7,'檜原村':6,'八丈町':5,
'大島町':4,'三宅村':3,'津島村':2,'新島村':1}

for k , v  in land_value_mapping.items():
    print(k, v)
#ランキングを参考にある値を埋めていく
land_value_mapping={
'中央区':59,'千代田区':58,'港区':57,'渋谷区':56,'新宿区':55,'豊島区':54,
'台東区':53,'文京区':52,'武蔵野市':51,'目黒区':50,
'品川区':49,'中野区':48,'世田谷区':47,'杉並区':46,'北区':45,'荒川区':44,'立川市':43,
'江東区':42,'墨田区':41,'三鷹市':40,
'大田区':39,'板橋区':38,'小金井市':37,'練馬区':36,'国分寺市':35,
'江戸川区':34,'足立区':33,'調布市':32,'葛飾区':31,'府中市':30,
'国立市':29,'狛江市':28,'西東京市':27,'小平市':26,'稲城市':25,'多摩市':24,
'清瀬市':23,'町田市':22,'東村山市':21,'東久留米市':20,
'日野市':19,'昭島市':18,'福生市':17,'東大和市':16,'八王子市':15,'羽村市':14,
'武蔵村山市':13,'瑞穂町':12,'青梅市':11,
'あきる野市':10,'日の出町':9,'奥多摩町':8,'小笠原村':7,'檜原村':6,'八丈町':5,
'大島町':4,'三宅村':3,'津島村':2,'新島村':1}
for k , v in land_value_mapping.items():
  train_test.所在地[train_test.所在地.str.contains(k)] = str(v)
